// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураФО = Новый Структура;
	СтруктураФО.Вставить("Аттракцион", Объект.Аттракцион);
	НачалоДействия = ПолучитьФункциональнуюОпцию("НастройкаАттракциона", СтруктураФО);//Дата
	Если НачалоДействия <> Ложь Тогда
		Если Объект.Дата >= НачалоДействия Тогда
			Элементы.Комментарий.Видимость = Истина;
		Иначе
			Элементы.Комментарий.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
